Revit 2026 API

# DocumentSetUnits Method

---

Sets the units.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetUnits(
	Units units
)
```
```vb
Public Sub SetUnits (
	units As Units
)
```
```cpp
public:
void SetUnits(
	Units^ units
)
```
```fsharp
member SetUnits :
        units : Units -> unit
```

#### Parameters

units Units
     The units.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Document Class

Autodesk.Revit.DB Namespace